Creating the EIGRP process, adding routes and passive interface:

```
router eigrp <AS>
network <network ip> <wildcard mask>
passive-int default (all)
no passive-int <g0/0>
```

Adding default route:
(default route must already be in the routing table to redistribute):

```
router(config)# ip route 0.0.0.0 0.0.0.0 10.4.6.1
router(config)# router eigrp 50
router(config-router)#default-metric 10000 10 255 1 1500
router(config-router)# redistribute static
```





create the EIGRP process:
		router(config)# router eigrp 50

adding interfaces to the EIGRP AS:
		router(config-router)# network 10.1.2.0(network ip) 0.0.0.3(wildcard mask)
		router(config-router)# network 10.2.1.0(network ip) 0.0.0.255(wildcard mask)


single interfaces:
	router(config)# router eigrp 50
	router(config-router)# passive-interface g0/1
	router(config-router)# passive-interface g0/2

all but select interfaces:
	router(config)# router eigrp 50
	router(config-router)#passive-interface default
	router(config-router)# no passive-interface g0/3


EIGRP DEFAULT ROUTE CONFIG
	default route must already be in the routing table
	to redistribute:
		router(config)# ip route 0.0.0.0 0.0.0.0 10.4.6.1
		router(config)# router eigrp 50
		router(config-router)#default-metric 10000 10 255 1 1500
		router(config-router)# redistribute static


redistribute static routes into EIGRP:

```
router(config-router)# redistribute static
```

redistribute OSPF 10 into EIGRP:

```
router(config-router)# redistribute ospf <AS>
```


EIGRP VERIFICATION

	to show EIGRP neighbor table:
		show ip eigrp neighbors

	to show EIGRP topology table:
		show ip eigrp topology

	to show EIGRP routes in the routing table:
		show ip route eigrp

	to show interfaces matching the network statements:
		show ip eigrp interfaces

	to show configured routing protocols: 
		show ip protocols  (GOOD FOR DISCOVERY)
